---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInJoistSystemSketch
source: html/0157d83b-ec20-e596-49c3-ff541714148b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInJoistSystemSketch Property

Structural Beam System sketch can't be constrained to its beam.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongConstraintInJoistSystemSketch { get; }
```